page/about/index.html
<!DOCTYPE html>
<html lang="pt-br">
<head>  <meta charset="utf-8">
  <meta name="viewport" content="width=device-width, initial-scale=1.0">
  <link rel="icon" href="data:,">
  <title>Sobre — lobovit</title>
  <link rel="stylesheet" href="/css/main.css?v=3">
  <link rel="stylesheet" href="/vendor/fonts/fonts.css">
  <link rel="stylesheet" href="/vendor/prism/prism-mocha.min.css">
</head>
<body>
  <div class="frame">
    <header>
      <nav>
        <a class="site-title" href="http://localhost:1313/">lobovit</a>
        <span class="nav-links">
          <a href="/page/about/">about</a>
          <a href="/page/contact/">contact</a>
        </span>
      </nav>
      <hr>
    </header>
    <main>
      
<article>
  <header>
    <h1>Sobre</h1>
    <p class="meta"><time>2025-07-28</time></p>
  </header>
  <div class="content">
    
<p>
Olá, eu sou <strong>Vitor Lobo</strong>, ou simplesmente Lobo.</p>
<p>
Sou desenvolvedor com mais de 15 anos de experiência e já passei por infraestrutura, engenharia de plataforma e SRE. Mas é no código que me encontro: construir soluções e entregar valor, seja corporativo ou social, é o que me move. Comecei em 2009 nas comunidades open source do IRC (falecida freenode). Foi ali que aprendi sobre colaboração, compartilhamento e a cultura do software livre e open source. Mantenho este blog para compartilhar descobertas, aprendizados e conhecimento em geral.</p>
<div id="outline-container-headline-1" class="outline-2">
<h2 id="headline-1">
Projetos
</h2>
<div id="outline-text-headline-1" class="outline-text-2">
<div id="outline-container-headline-2" class="outline-3">
<h3 id="headline-2">
Go
</h3>
<div id="outline-text-headline-2" class="outline-text-3">
<ul>
<li><a href="https://github.com/lobovit/ollanta">Ollanta</a>, análise estática multi-linguagem</li>
<li><a href="https://github.com/lobovit/saitama">Saitama</a>, graceful shutdown para processos Unix</li>
<li><a href="https://github.com/lobovit/gopherlab">GopherLab</a>, laboratório de experimentos em Go</li>
</ul>
</div>
</div>
<div id="outline-container-headline-3" class="outline-3">
<h3 id="headline-3">
Clojure
</h3>
<div id="outline-text-headline-3" class="outline-text-3">
<ul>
<li><a href="https://github.com/lobovit/dogai">Dogai</a>, detecção de objetos em vídeo com redes neurais</li>
<li><a href="https://github.com/lobovit/docai">Docai</a>, assistente RAG para documentação técnica</li>
<li><a href="https://github.com/lobovit/pomodoro">Pomodoro</a>, técnica Pomodoro integrada ao Emacs</li>
</ul>
</div>
</div>
<div id="outline-container-headline-4" class="outline-3">
<h3 id="headline-4">
C / Rust
</h3>
<div id="outline-text-headline-4" class="outline-text-3">
<ul>
<li><a href="https://github.com/lobovit/checkrc">Checkrc</a>, validador de configurações para FreeBSD</li>
<li><a href="https://github.com/rochacbruno/marmite">Marmite</a>, contribuições para este gerador de sites estáticos em Rust</li>
</ul>
</div>
</div>
<div id="outline-container-headline-5" class="outline-3">
<h3 id="headline-5">
Contribuições open source
</h3>
<div id="outline-text-headline-5" class="outline-text-3">
<ul>
<li><a href="https://github.com/SpectoLabs/hoverfly">Hoverfly</a>, simulação e mock de APIs</li>
<li><a href="https://github.com/spf13/cobra">Cobra</a>, biblioteca de CLI em Go</li>
<li><a href="https://github.com/elazarl/goproxy">Go Proxy</a>, proxy HTTP/HTTPS em Go</li>
</ul>
<p>Fora do código, gosto de escrever, estudar filosofia e literatura, e coleciono livros da editora DarkSide.</p>
</div>
</div>
</div>
</div>

  </div>
</article>

    </main>
    <hr>
    <footer>
    </footer>
  </div>
<script>window.Prism = window.Prism || {}; Prism.manual = true;</script>
<script src="/vendor/prism/prism-core.min.js"></script>
<script src="/vendor/prism/prism-clike.min.js"></script>
<script src="/vendor/prism/prism-bash.min.js"></script>
<script src="/vendor/prism/prism-c.min.js"></script>
<script src="/vendor/prism/prism-cpp.min.js"></script>
<script src="/vendor/prism/prism-rust.min.js"></script>
<script src="/vendor/prism/prism-go.min.js"></script>
<script src="/vendor/prism/prism-javascript.min.js"></script>
<script src="/vendor/prism/prism-typescript.min.js"></script>
<script src="/vendor/prism/prism-clojure.min.js"></script>
<script src="/vendor/prism/prism-lisp.min.js"></script>
<script src="/vendor/prism/prism-swift.min.js"></script>
<script src="/vendor/prism/prism-zig.min.js"></script>
<script src="/vendor/prism/prism-sql.min.js"></script>
<script src="/vendor/prism/prism-autoloader.min.js"></script>
  <script src="/vendor/mermaid/mermaid.min.js"></script>
  <script>
    mermaid.initialize({ startOnLoad: false, theme: 'base', themeVariables: { fontFamily: '"Inter", system-ui, sans-serif', fontSize: '14px', primaryColor: '#cba6f7', primaryTextColor: '#cdd6f4', primaryBorderColor: '#7f849c', lineColor: '#89b4fa', secondaryColor: '#313244', tertiaryColor: '#45475a' } });
    document.addEventListener('DOMContentLoaded', function() {
      document.querySelectorAll('code.language-mermaid').forEach(function(el) {
        var mDiv = document.createElement('div');
        mDiv.className = 'mermaid';
        mDiv.textContent = el.textContent;
        var wrap = el.closest('.src-mermaid') || el.closest('.src') || el.closest('.highlight') || el.parentElement;
        if (wrap) wrap.replaceWith(mDiv);
      });
      mermaid.run();
    });
  </script>
  <button class="back-to-top" onclick="window.scrollTo({top:0,behavior:'smooth'})">^ top</button>
  <script>
    document.querySelectorAll('.content table').forEach(function(t) {
      if (t.closest('.table-wrapper')) return;
      var w = document.createElement('div');
      w.className = 'table-wrapper';
      t.parentNode.insertBefore(w, t);
      w.appendChild(t);
    });
  </script>
  <script>
    var btn = document.querySelector('.back-to-top');
    window.addEventListener('scroll', function() {
      btn.classList.toggle('visible', window.scrollY > 400);
    });
  </script>
</body>
</html>
